{
  "majorArcana": [
    {
      "id": 0,
      "title": "The Street Kid",
      "image": "00-street-kid.png",
      "description": "The Fool reimagined as a street kid on the city's edge. Unbound by the system, carrying nothing but potential. Every journey begins from nothing.",
      "reading": "You stand at the beginning of something new. Maybe you feel unprepared, maybe you have nothing but your wits and your nerve—but that's enough. Trust your instincts. The path reveals itself only to those brave enough to take the first step. Leap."
    },
    {
      "id": 1,
      "title": "The Netrunner",
      "image": "01-netrunner.png",
      "description": "The Magician as master hacker. All the tools are ready, the connection is live. Willpower and skill transform thought into reality.",
      "reading": "You have all the tools you need. Your skills, your knowledge, your resourcefulness—they're waiting to be used. Stop doubting and start doing. The power to shape your reality is already in your hands. Execute."
    },
    {
      "id": 2,
      "title": "The Data Witch",
      "image": "02-data-witch.png",
      "description": "The High Priestess as data oracle. She reads the hidden patterns, the secrets between the code. Trust the knowledge that can't be explained.",
      "reading": "Something is hidden from you, but you already sense it. Trust that quiet voice, the one that notices what others miss. The truth is there in the patterns—you just need to stop looking and start seeing. Go deeper."
    },
    {
      "id": 3,
      "title": "The Greenhouse",
      "image": "03-greenhouse.png",
      "description": "The Empress as sanctuary of growth. Life flourishes even in the machine city. Nurture what matters and watch it bloom.",
      "reading": "Growth is happening, even if you can't see it yet. Nurture what you've planted—projects, relationships, yourself. Create the conditions for life to flourish and be patient. Something beautiful is taking root."
    },
    {
      "id": 4,
      "title": "The Corpo Exec",
      "image": "04-corpo-exec.jpeg",
      "description": "The Emperor as corporate patriarch. Authority built over decades, power maintained through structure. Sometimes you need to take the throne.",
      "reading": "It's time to take control. Structure, discipline, and clear boundaries will serve you now. You have more authority over your situation than you realize—own it. Make the hard calls. Lead."
    },
    {
      "id": 5,
      "title": "The Techno-Priest",
      "image": "05-techno-priest.png",
      "description": "The Hierophant as keeper of digital tradition. Ancient wisdom encoded in new systems. Seek guidance from those who came before.",
      "reading": "Seek guidance from those who walked this path before you. There's wisdom in tradition, in mentors, in established ways of doing things. You don't have to figure this out alone. Learn from the source."
    },
    {
      "id": 6,
      "title": "The Link",
      "image": "06-link.png",
      "description": "The Lovers as the moment of connection. A choice about who to reach for, what to value. Union requires vulnerability.",
      "reading": "A significant choice stands before you—about connection, partnership, or values. This isn't about right or wrong; it's about alignment. What do you truly want? Who do you want to become with? Choose with your whole self."
    },
    {
      "id": 7,
      "title": "The Wheelman",
      "image": "07-wheelman.png",
      "description": "The Chariot as road warrior. Victory through momentum and control. Point yourself at the horizon and don't look back.",
      "reading": "Momentum is on your side. You've got the drive and the direction—now push forward with everything you've got. Obstacles will blur past if you keep your focus sharp. Don't slow down. Accelerate."
    },
    {
      "id": 8,
      "title": "The Sea Wall",
      "image": "08-sea-wall.png",
      "description": "Strength as quiet endurance. Not the force that attacks, but the barrier that holds. Resilience is its own kind of power.",
      "reading": "You're stronger than you know. The pressure is real, but you can hold. This isn't about fighting—it's about enduring with grace. Find your inner resilience. You are the wall that doesn't break."
    },
    {
      "id": 9,
      "title": "The Offline",
      "image": "09-offline.png",
      "description": "The Hermit as the one who logged off. Wisdom found in disconnection. Sometimes the signal only comes through in silence.",
      "reading": "Step back. Disconnect. The answers you're looking for won't come from more noise and input—they'll come from solitude and reflection. Take time alone to find your own signal in the static."
    },
    {
      "id": 10,
      "title": "The Market",
      "image": "10-market.png",
      "description": "The Wheel of Fortune as market forces. Fortunes rise and crash in cycles beyond anyone's control. Adapt to the turn or be crushed by it.",
      "reading": "Change is coming whether you're ready or not. The wheel turns—what's up goes down, what's down comes up. Don't cling too tightly to how things are. Adapt, roll with it, and trust the cycle."
    },
    {
      "id": 11,
      "title": "Enforcement",
      "image": "11-enforcement.png",
      "description": "Justice as enforcement. The system sees all and weighs all. Consequences find everyone eventually—make sure yours are earned.",
      "reading": "Be honest with yourself. What's fair here? What do you actually deserve, and what are you pretending not to see? Accountability cuts both ways. Accept the consequences and deal with others fairly."
    },
    {
      "id": 12,
      "title": "The Test Patient",
      "image": "12-test-patient.png",
      "description": "The Hanged Man as willing subject. Surrender to the process brings new perspective. Sometimes you have to let go to see clearly.",
      "reading": "Let go. Stop struggling against the situation and see what it has to teach you. This pause, this suspension—it's not wasted time. A new perspective only comes when you stop trying to force the old one."
    },
    {
      "id": 13,
      "title": "Murder",
      "image": "13-murder.png",
      "description": "Death as transformation. Something ends so something else can begin. The old self must flatline before the new one can boot up.",
      "reading": "Something must end. A chapter, a habit, a version of yourself—it's time to let it die. This isn't loss; it's transformation. You can't carry the old into the new. Release your grip and let it go."
    },
    {
      "id": 14,
      "title": "Cyberware",
      "image": "14-cyberware.png",
      "description": "Temperance as human-machine synthesis. Flesh and chrome in balance. Integration, not domination—find harmony between opposing forces.",
      "reading": "Find your balance. You're being pulled in different directions—moderation is the path through. Integrate the opposing forces in your life rather than choosing one extreme. Harmony comes from synthesis."
    },
    {
      "id": 15,
      "title": "The Corp",
      "image": "15-corp.png",
      "description": "The Devil as corporate machine. The system that feeds on you while you feed it. Name your chains before you can break them.",
      "reading": "Look at what's binding you. What comfort or security are you trading your freedom for? The chains might be golden, but they're still chains. Name the addiction, the dependency, the fear that keeps you trapped."
    },
    {
      "id": 16,
      "title": "The Mega Building",
      "image": "16-mega-building.png",
      "description": "The Tower as catastrophic failure. What looked permanent comes down fast. Destruction clears the way for what should have been built instead.",
      "reading": "Disruption is here or coming soon. Something you thought was solid is shaking. This destruction, as painful as it is, clears away what was built on false foundations. Let it fall. Rebuild better."
    },
    {
      "id": 17,
      "title": "The Rocket",
      "image": "17-rocket.png",
      "description": "The Star as hope ascending. After the collapse, the launch. Faith in a better destination keeps you climbing toward it.",
      "reading": "Hope is not naive—it's necessary. After the hardship, after the collapse, this is your sign to believe again. Something is guiding you toward healing. Keep your eyes on the stars and trust the trajectory."
    },
    {
      "id": 18,
      "title": "The Holo Ad",
      "image": "18-holo-ad.png",
      "description": "The Moon as illusion and projection. Not everything glowing is guiding you. Look past the advertisement to see what's actually there.",
      "reading": "Not everything is as it appears. Someone or something is presenting an illusion—maybe even you to yourself. Don't make decisions in the dark. Wait for clarity, question your assumptions, and look past the projection."
    },
    {
      "id": 19,
      "title": "The Reactor",
      "image": "19-reactor.png",
      "description": "The Sun as vital energy. The core that powers everything around it. Success, clarity, and warmth—step into the light.",
      "reading": "Yes. This is your moment of clarity and success. Energy, vitality, and joy are available to you right now. Step into the light, celebrate what's working, and let yourself feel good about where you are."
    },
    {
      "id": 20,
      "title": "Reboot",
      "image": "20-reboot.png",
      "description": "Judgement as system reboot. The call to restart, to answer for what was and begin again. Your second chance is waiting to be activated.",
      "reading": "You're being called to rise. A past version of you, a past project, a past purpose—it's ready to come back online. Answer the call. This is your second chance, your resurrection. Wake up."
    },
    {
      "id": 21,
      "title": "The City",
      "image": "21-city.png",
      "description": "The World as completed circuit. Everything connected, the cycle fulfilled. You've reached the end of one journey—the next awaits.",
      "reading": "Completion. You've come full circle—take a moment to recognize how far you've traveled. Integration, wholeness, accomplishment. Before the next cycle begins, honor this one. You made it. You're here."
    }
  ]
}
